Plugin Example
Remarks
This VB.NET plugin example can be created with Visual Studio 2017 or higher.
This page shows how to create a simple .NET plugin that can be added to the Tools menu in the SAP2000 program. This plugin has minimal functionality, it is intended to demonstrate the proper way to implement the cPlugin class.
Procedure
Create a new project of type .NET Framework Class Library (.DLL) . The language should be Visual Basic.
Navigate to the project Properties, and change the Assembly Name to your preferred plugin assembly name, for example SimplePlugin .
Add a reference to C:\ Program Files\Computers and Structures\SAP2000 24\SAP2000v1.DLL to the project. Modify the path as appropriate for CSiBridge or if you have installed the program in a different location. If you want to create a plugin that can be used in other CSi products that support plugins, you can instead add a reference to the cross-product API library, C:\ Program Files\Computers and Structures\SAP2000 24\CSiAPIv1v1.DLL
Import the SAP2000v1 (or CSiAPIv1 ) namespace, either at the project level (on the References page of the project Properties), or with an Imports SAP2000v1 line at the top of your class file.
Paste the example code below into the class file. Please pay attention to the comments in this code block, they contain additional important information
Compile the project, selecting either AnyCPU or x64 as the platform. Please note that all CSi programs are 64-bit. The output plugin assembly is a file with the name you selected in Step 2 and a DLL extension.
To add this plugin to the Tools menu in SAP2000, navigate to the Tools menu and select Add/Show Plugins . This will open the External Plugin Data form shown below
In the External Plugin Data form, click Browse, then locate and select your plugin assembly DLL .
The textbox fields will automatically populate with your plugin information. You can modify the Menu Text field as preferred.
Click the Add button. Check that the Status field reads OK. You can click the Info button to view information about the plugin.
Close the External Plugin Data form.
Your plugin now appears in the Tools menu drop-down. Click on it to run your plugin.
Example Code
''' <summary>
''' This is the class that the CSi program will use when starting your plugin.
''' The name of this class must be cPlugin , with that exact capitalization.
''' It should implement the cPluginContract interface, as demonstrated below.
''' </summary>
Public Class cPlugin
Implements cPluginContract
'''  <summary>
''' The entry point for launching the plugin
''' </summary>
''' <param name="SapModel">
''' A reference to the SapModel object upon which all operations will be performed
''' </param>
''' <param name="ISapPlugin">
''' A reference to the callback object, used to retrieve the plugin status and notify the program when the plugin is closed
''' </param>
Public Sub Main(ByRef SapModel As cSapModel, ByRef ISapPlugin As cPluginCallback) Implements cPluginContract.Main
Dim errorCode As Integer = -1
Try
Dim ret As Integer = -1
ret = SapModel.InitializeNewModel()
ret = SapModel.File.NewBlank()
ret = SapModel.PropMaterial.SetMaterial("CONC", eMatType.Concrete)
ret = SapModel.PropFrame.SetRectangle("R1", "CONC", 12, 12)
Dim frameName As String = ""
ret = SapModel.FrameObj.AddByCoord(0, 0, 0, 10, 0, 0, frameName, "R1", "1")
ret = SapModel.View.RefreshView(0, False)
MsgBox("Hello CSI World")
errorCode = 0
Catch ex As Exception
errorCode = 1
Finally
'It is not necessarily required to call ISapPlugin.Finish before the Main method returns.
'For instance, your plugin may launch an interactive form for users.
'In that case, you would pass a reference to the ISapPlugin object to your form,
'and call ISapPlugin.Finish in that form's closing event
ISapPlugin.Finish(errorCode)
End Try
End Sub
'''  <summary>
''' Provides information about the plugin
''' </summary>
'''  <param name="Text">
''' Information about the plugin, e.g. author, version, description
'''  </param>
'''  <returns>
''' Returns zero if the information is successfully retrieved; otherwise it returns a nonzero value
'''  </returns>
Public Function Info(ByRef Text As String) As Integer Implements cPluginContract.Info
Try
Text = "A simple example plugin. Author, Company, Version, Etc"
Return 0
Catch ex As Exception
Return 1
End Try
End Function
End Class
See Also
cPluginCallback Interface
cPluginContract Interface